Q1. List any five functions of the pandas library with execution.

In [43]:
import pandas as pd

In [44]:
# 1.DataFrame
data = {'a' : [1,2,3,4,5],
       'b':[6,7,8,9,10],
       'c':[11,12,13,14,15]}
df = pd.DataFrame(data)
df

   a   b   c
0  1   6  11
1  2   7  12
2  3   8  13
3  4   9  14
4  5  10  15

In [45]:
#2.Series
ds = pd.Series(data)
ds

a         [1, 2, 3, 4, 5]
b        [6, 7, 8, 9, 10]
c    [11, 12, 13, 14, 15]
dtype: object

In [46]:
#3.describe
df.describe()

              a          b          c
count  5.000000   5.000000   5.000000
mean   3.000000   8.000000  13.000000
std    1.581139   1.581139   1.581139
min    1.000000   6.000000  11.000000
25%    2.000000   7.000000  12.000000
50%    3.000000   8.000000  13.000000
75%    4.000000   9.000000  14.000000
max    5.000000  10.000000  15.000000

In [47]:
#4.info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       5 non-null      int64
 1   b       5 non-null      int64
 2   c       5 non-null      int64
dtypes: int64(3)
memory usage: 248.0 bytes

In [48]:
#5.type
type(df)

pandas.core.frame.DataFrame

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [49]:
data = {"A":[1,2,3,4,5],
       'B':[7,8,9,10,11],
       'C':[12,13,14,15,16]}
df = pd.DataFrame(data)
df

   A   B   C
0  1   7  12
1  2   8  13
2  3   9  14
3  4  10  15
4  5  11  16

In [50]:
index = [1,3,5,7,9]
df = pd.DataFrame(data,index=index)
df

   A   B   C
1  1   7  12
3  2   8  13
5  3   9  14
7  4  10  15
9  5  11  16

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [51]:
data = {'Values':[1,2,3,4,5,67]}
df = pd.DataFrame(data)
def check_sum(data):
    sum = 0
    for i in range(3):
        sum+=data[i]
    return sum
check_sum(df['Values'])

6

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [52]:
data = {"text":['my name is arindam sarkar','i leaning now data science ','i use python language for machine learning']}
df=pd.DataFrame(data)
df

                                         text
0                   my name is arindam sarkar
1                 i leaning now data science
2  i use python language for machine learning

In [53]:
df['Word_count']=df['text'].apply(lambda x : len(x.split()))

In [54]:
df

                                         text  Word_count
0                   my name is arindam sarkar           5
1                 i leaning now data science            5
2  i use python language for machine learning           7

Q5. How are DataFrame.size() and DataFrame.shape() different?

In [55]:
df.size

6

In [56]:
df.shape

(3, 2)

df.size give you total number of data exist in our table but df.shape is give us the shape of the matrix total number of column and rows

Q6. Which function of pandas do we use to read an excel file?

Ans : pd.read_excel()

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [57]:
data = {'Email':['arindam@gmail.com','nirmala@gmail.com','bharat@gmail.com','sonia@gmail.com']}

In [58]:
df = pd.DataFrame(data)

In [59]:
df

               Email
0  arindam@gmail.com
1  nirmala@gmail.com
2   bharat@gmail.com
3    sonia@gmail.com

In [62]:
df['Username']= df['Email'].apply(lambda x : x.split('@')[0])

In [63]:
df

               Email Username
0  arindam@gmail.com  arindam
1  nirmala@gmail.com  nirmala
2   bharat@gmail.com   bharat
3    sonia@gmail.com    sonia

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [11]:
import pandas as pd
data  = {
        'A':[3,8,6,2,9],
        'B':[5,2,9,3,1],
        'C':[1,7,4,5,2]}
df = pd.DataFrame(data)

df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [13]:
df[(df['A']>5) & (df['B']<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [14]:
data = {'values':[1,2,3,45,6]}
df = pd.DataFrame(data)

In [16]:
df.mean()

values    11.4
dtype: float64

In [17]:
df.median()

values    3.0
dtype: float64

In [18]:
df.std()

values    18.875911
dtype: float64

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [26]:
data = {'Sales':[34,56,78,33,29,45,45,57,89,34,68,789,33,1345,24,67],
 'Dates':['2023-10-12','2023-10-13','2023-10-14','2023-10-15','2023-10-16','2023-10-17','2023-10-18','2023-10-19','2023-10-20','2023-10-21','2023-10-22','2023-10-23','2023-10-24','2023-10-25','2023-10-26','2023-10-27']}
df = pd.DataFrame(data)

In [27]:
df

    Sales       Dates
0      34  2023-10-12
1      56  2023-10-13
2      78  2023-10-14
3      33  2023-10-15
4      29  2023-10-16
5      45  2023-10-17
6      45  2023-10-18
7      57  2023-10-19
8      89  2023-10-20
9      34  2023-10-21
10     68  2023-10-22
11    789  2023-10-23
12     33  2023-10-24
13   1345  2023-10-25
14     24  2023-10-26
15     67  2023-10-27

In [28]:
df['Sales'].rolling(window=7).mean()

0            NaN
1            NaN
2            NaN
3            NaN
4            NaN
5            NaN
6      45.714286
7      49.000000
8      53.714286
9      47.428571
10     52.428571
11    161.000000
12    159.285714
13    345.000000
14    340.285714
15    337.142857
Name: Sales, dtype: float64

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [38]:
data = {
 'Dates':['2023-10-01','2023-10-02','2023-10-03','2023-10-04','2023-10-16','2023-10-17','2023-10-18','2023-10-19','2023-10-20','2023-10-21','2023-10-22','2023-10-23','2023-10-24','2023-10-25','2023-10-26','2023-10-27']}
df = pd.DataFrame(data)

In [39]:
df

         Dates
0   2023-10-01
1   2023-10-02
2   2023-10-03
3   2023-10-04
4   2023-10-16
5   2023-10-17
6   2023-10-18
7   2023-10-19
8   2023-10-20
9   2023-10-21
10  2023-10-22
11  2023-10-23
12  2023-10-24
13  2023-10-25
14  2023-10-26
15  2023-10-27

In [40]:
df['Dates'] = pd.to_datetime(df['Dates'])

In [41]:
df

        Dates
0  2023-10-01
1  2023-10-02
2  2023-10-03
3  2023-10-04
4  2023-10-16
5  2023-10-17
6  2023-10-18
7  2023-10-19
8  2023-10-20
9  2023-10-21
10 2023-10-22
11 2023-10-23
12 2023-10-24
13 2023-10-25
14 2023-10-26
15 2023-10-27

In [42]:
df['weekdays']=df['Dates'].dt.weekday

In [46]:
days = ["Monday", "Tuesday", "Wednesday",
        "Thursday", "Friday", "Saturday", "Sunday"]
df['weekdays'] =df['weekdays'].apply(lambda x :days[x] )

In [47]:
df

        Dates   weekdays
0  2023-10-01     Sunday
1  2023-10-02     Monday
2  2023-10-03    Tuesday
3  2023-10-04  Wednesday
4  2023-10-16     Monday
5  2023-10-17    Tuesday
6  2023-10-18  Wednesday
7  2023-10-19   Thursday
8  2023-10-20     Friday
9  2023-10-21   Saturday
10 2023-10-22     Sunday
11 2023-10-23     Monday
12 2023-10-24    Tuesday
13 2023-10-25  Wednesday
14 2023-10-26   Thursday
15 2023-10-27     Friday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [48]:
import pandas as pd
data = {'Name': ['Tani', 'Saumya',
                 'Ganesh', 'Kirti'],
  
        'Articles': [5, 3, 4, 3],
  
        'Location': ['Kanpur', 'Kolkata',
                     'Kolkata', 'Bombay'],
        'Dates': ['2020-08-04', '2020-08-07', '2020-08-08', '2020-06-08']}
  
# Create DataFrame
df = pd.DataFrame(data)
start_date = '2020-08-05'
end_date = '2020-08-08'
mask = (df['Dates'] > start_date) & (df['Dates'] <= end_date)
  
df = df.loc[mask]
display(df)

     Name  Articles Location       Dates
1  Saumya         3  Kolkata  2020-08-07
2  Ganesh         4  Kolkata  2020-08-08

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?
Ans : pandas